[{"title": "Deadline Closing for Names to Fly on NASA's Next Mars Rover", "preview": "You have until Sept. 30 to send your names to Mars aboard the Mars 2020 rover. "}, {"title": "Global Storms on Mars Launch Dust Towers Into the Sky", "preview": "A Mars Dust Tower Stands Out Dust storms are common on Mars. But every decade or so, something unpredictable happens: a series of runaway storms break out, covering the entire planet in a dusty haze."}, {"title": "New Selfie Shows Curiosity, the Mars Chemist", "preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."}, {"title": "NASA's InSight Flexes Its Arm While Its 'Mole' Hits Pause", "preview": "Now that the lander's robotic arm has helped the mole get underground, it will resume science activities that have been on hold."}, {"title": "NASA to Hold Mars 2020 Perseverance Rover Launch Briefing", "preview": "Learn more about the agency's next Red Planet mission during a live event on June 17."}, {"title": "Celebrate Mars Reconnaissance Orbiter's Views From Above", "preview": "Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."}, {"title": "NASA-JPL Names 'Rolling Stones Rock' on Mars", "preview": "NASA's Mars InSight mission honored one of the biggest bands of all time at Pasadena concert."}, {"title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet", "preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."}, {"title": "From JPL's Mailroom to Mars and Beyond", "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."}, {"title": "NASA's Mars Perseverance Rover Gets Its Sample Handling System", "preview": "The system will be collecting and storing Martian rock and soil. Its installation marks another milestone in the march toward the July launch period."}, {"title": "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet", "preview": "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021. "}, {"title": "The Extraordinary Sample-Gathering System of NASA's Perseverance Mars Rover", "preview": "Two astronauts collected Moon rocks on Apollo 11. It will take three robotic systems working together to gather up the first Mars rock samples for return to Earth."}, {"title": "NASA's Perseverance Rover Will Carry First Spacesuit Materials to Mars", "preview": "In a Q&A, spacesuit designer Amy Ross explains how five samples, including a piece of helmet visor, will be tested aboard the rover, which is targeting a July 30 launch. "}, {"title": "NASA's Mars Reconnaissance Orbiter Undergoes Memory Update", "preview": "Other orbiters will continue relaying data from Mars surface missions for a two-week period."}, {"title": "While Stargazing on Mars, NASA's Curiosity Rover Spots Earth and Venus", "preview": "This new portrait of the Red Planet's neighbors was taken during a time when there's more dust in the air on Mars."}]